## Language settings
##
## [UIFont] section
##    font used for UI if you need some special font setting for the language.
## [Locale] section
##   2char language codes 
##   affect to messagebox buttons
## [Menu] section 
##   function=<Menu Text>,<Menu Mnemonic char>,<Tooltip Text> 
## [Buttons] section
##   GUI buttons. <Button Text>,<Tooltop Text>
##
[UIFont]
font=
sizesmall=9
sizenormal=12
sizelarge=12
[Locale]
locale=uk
[Pane]
primitive=Primitive
layerpreview=Layer Preview
effects=Effects
[Menu]
file=Файл,Ф
new=Новий,Н
export=Експорт результату...,Е,Export image as (png / jpg / bmp / gif / tga)
load=Відкрити...,В,Open .knob file
recent=Recent files
save=Зберегти,s
saveas=Зберегти як...,я,Save as .knob file
config=Налаштування...
exit=Вихід,х
edit=Редагування,Р
undo=Відмінити,В
redo=Повторити,П
setlayout=Set Layout...,l
layer=Шари,Ш
renamelayer=Перейменувати...,П
addlayer=Додати новий шар
duplayer=Зробити дублікат шару
dellayer=Видалити шар
backlayer=Вгору,В
forelayer=MВниз,н
copylayer=Копіювати шар
pastelayer=Вставити шар
animcurve=Крива анімації,К
curve1=Крива 1,1
curve2=Крива 2,2
curve3=Крива 3,3
curve4=Крива 4,4
curve5=Крива 5,5
curve6=Крива 6,6
curve7=Крива 7,7
curve8=Крива 8,8
test=Тест,t
testknob=Test Knob,t
help=Допомога,Д
helpindex=Показати інструкцію
knobgallery=Knob Gallery,g
[Layers]
preference=preference
layer=Layer %d
[Buttons]
addlayer=Add
duplayer=Duplicate
dellayer=Remove
backlayer=Move Back
forelayer=Move Forard
preview=Preview
render=Render
test=Test,Test Mode
zoomout=Zoom Out
zoom1=Zoom 1:1
zoomin=Zoom In
[Primitive]
type=Тип:
typenone=None
typeimage=Image
typecircle=Circle
typecirclefill=Filled Circle
typemetalcircle=Metal Circle
typewavecircle=Wave Circel
typesphere=Sphere
typerect=Rectangle
typerectfill=Filled Rectangle
typetriangle=Triangle
typeline=Line
typeradiateline=Radial Lines
typehlines=Horizontal Lines
typevlines=Vertical Lines
typetext=Text
typeshape=Shape
aspect=Витягнутість:
round=Заокруглення:
width=Ширина:
length=Довжина:
step=Крок:
anglestep=Кутовий крок:
emboss=Рельєф:
embossdiffuse=М'якість рел.:
ambient=Середовище:
lightdir=Напрям світла:
specular=Віддзеркалення:
specularwidth=Ширина віддз.:
texturefile=Текстура:
texturedepth=Глибина текст.:
texturezoom=Масштаб текст.:
diffuse=М'якість:
file=Файл:
fileset=Browse
transparent=Прозорість:
filealpha=Використати alpha із файлу
opaque=Не прозорий
1stpixel=Викор. колір 1-го пікселу
intellialpha=Розумна alpha:
autofit=AВмістити :
multiframe=Багато фреймовість:
framealign=Orientation :
vertical=Вертик. розб.
horizontal=Горизонт. розб.
individual=Окремі файли
text=Текст:
font=Шрифт:
fontsize=Розмір шрифту:
bold=Жирний
italic=Прописний
textalign=Вирівнювання:
center=Center
left=Left
right=Right
shape=Форма:
edit=Редагування
fill=Fill
color=Колір:
[Effects]
antialias=Антиаліасинг
unfold=Розкласти
animstep=Крок:
zoom=Масштаб
xysepa=XY окремо
x=X(%):
y=Y(%):
layoutoffset=Зсув
rotateat=Повернути на
keepdir=Зберегти положення
centerx=Центр X(%):
centery=Центр Y(%):
angle=Кут:
colors=Кольори
alpha=Альфа (%):
bright=Яскравість (%):
contrast=Контраст (%):
saturation=Насиченість (%):
hue=Відтінок (град.):
mask=Маска
mask1ena=Вкл. маска 1
mask2ena=Вкл. маска 2
framemaskena=Вкл. маски фреймів
none=None
range=Range
maskbits=Bit-mask
framemaskbits=Bit-mask :
op=Операція:
and=And
or=Or
masktype=Тип:
rotate=Rotating
radius=Circular
horizontal=Horizontal
vertical=Vertical
gradation=Градація:
singledir=One-way
bidir=Two-way
maskstart=Старт (град./%):
maskstop=Стоп (град./%):
specular=Освітлення
dropshadow=Тінь
insideshadow=IВнутрішня тінь
edgehilight=Edge Highlight
lightdir=Напрям (град.):
offset=Здвиг (%):
density=Сила (%):
diffuse=Розсіювання:
shadowtype=Тип тіні:
shadowgrad=Gradient :
[Prefs]
width=Width:
link=Link Width/Height
height=Height:
oversampling=Oversampling:
x1=1x
x2=2x
x4=4x
prevframes=Preview Frames:
renderframes=Render Frames:
framealign=Orientation:
vertical=Vertical
horizontal=Horizontal
backcolor=Background Color:
exportopt=Export As:
stitched=Stitched Image
individual=Individual Files
anim=GIF/PNG Animation
duration=Duration (ms):
loop=Loop (0 for infinite):
shuttle=Shuttle
[CurveEditor]
curvelabel=Curve %d
stepreso=Step Resolution :
close=Close
[ShapeEditor]
grid=Grid Size :
gridenable=Snap To Grid
gridvisible=Show Grid
fill=Fill Shape
newpath=New Path
delpoint=Delete Point
pickhandle=Pick Handle
loadsvg=Load SVG...
savesvg=Save as SVG...
close=Close
[Config]
lookandfeel=Look & Feel :
language=Language :
shortcuts=Shortcuts :
wheeldir=Invert Mouse Wheel direction
usecapture=Use capture in Test mode (for JRE 6)
disablemnemo=Disable key mnemonics
regbrowser=Register KnobBrowser
unregbrowser=Unregister KnobBrowser
ok=Apply
restart=Restart
[Message]
renamelayer=Rename Layer
notsaved=Current file is not saved. Do you really want to exit?
dellayer=Do you really want to remove the selected layer?
imgformaterr=File format error! It should be PNG, BMP, JPG, JPEG or GIF!
animformaterr=Animation file format error. It should be PNG or GIF!
notfound=File not found!
overwrite=File already exists! Overwrite?
